In [1]:
import os
import pandas as pd
import sqlite3

In [2]:
os.getcwd()

'C:\\Users\\tanub\\Desktop\\midterm'

In [3]:
table = {'DataType' : ["Gene", "GOterm", "Experiment"]}
DataType = pd.DataFrame(table)
DataType.insert(0, 'DTID', range(1, 1+len(DataType)))
DataType

   DTID    DataType
0     1        Gene
1     2      GOterm
2     3  Experiment

In [4]:
con = sqlite3.connect("td2201_midterm.sqlite")
c = con.cursor()

In [5]:
#DataType table created here
c.execute("""
            CREATE TABLE DataType(DTID INT PRIMARY KEY NOT NULL, DataType TEXT)
""")

In [8]:
#number of tables in my db
pd.read_sql("""
            SELECT * FROM sqlite_master
            WHERE type='table';
""", con)

,type,name,tbl_name,rootpage,sql
0,table,DataType,DataType,2,CREATE TABLE DataType(DTID INT PRIMARY KEY NOT...

In [ ]:
#load the DataType df in the DataType table created in db
DataType.to_sql("DataType", con, index=False, if_exists="append")

In [9]:
pd.read_sql("""
            select * from DataType
""", con)

   DTID    DataType
0     1        Gene
1     2      GOterm
2     3  Experiment

In [10]:
con.close()